house_model_demo = {
    "houseNo": "04255Y",
    "name": "【精選】美好家園",
    "cityId": "1",
    "cityName": "台北市",
    "zipCode": "105",
    "zipName": "松山區",
    "images": [
        "https://res.sinyi.com.tw/buy/04255Y/bigimg/A.JPG",
        "https://res.sinyi.com.tw/buy/04255Y/bigimg/B.JPG",
        "https://res.sinyi.com.tw/buy/04255Y/bigimg/C.JPG"
    ],
    "shareURL": "http://sinyi.in/o/04255Y/0/3",
    "commId": "0023847",
    "commName": "劍橋世貿吉星",
    "address": "台北市松山區南京東路五段",
    "totalPrice": 2780,
    "priceFirst": 3080,
    "uniPrice": "68.76 萬/坪",
    "discount": -9.74,
    "isParking": False,
    "areaBuilding": 40.43,
    "areaLand": 4.05,
    "pingUsed": 28.06,
    "layout": "3房2廳2衛",
    "age": "31.6年",
    "houselandtype": [
        "L",
        "F"
    ],
    "floor": "6",
    "floors": "12",
    "agent": {
        "agentId": "315698",
        "agentName": "陳姵文",
        "agentStore": "南京店",
        "agentImage": "https://res.sinyi.com.tw/sale/315698/photo/315698.JPG",
        "agentTel": "0988868778",
        "agentStoreAddr": "台北市松山區南京東路四段１０２號",
        "agentStoreID": "R060",
        "agentStoreTel": "02-89786659"
    },
    "layoutImage": "https://res.sinyi.com.tw/buy/04255Y/bigimg/E.JPG",
    "layoutImage3D": None,
    "map": "https://res.sinyi.com.tw/buy/04255Y/lifeimg/04255Y_MAP.JPG",
    "vrType": 1,
    "vrDemoUrl": "https://web.sinyi.com.tw/3DVR/demo.php?guide=1",
    "vrUrl": "https://web.sinyi.com.tw/3DVR/index2.php?packageid=SinyiTW-408583_f426653e581b44c4aae2872b99e42c6c&memberId=&SID=MjAyMTA4MDQyMjA0MDg2MDg%3D&houseno=04255Y",
    "store": {
        "storeID": "R060",
        "storeName": "南京店",
        "storeAddr": "台北市松山區南京東路四段１０２號",
        "storeTel": "02-89786659"
    },
    "objectType": 1,
    "isHasBalcony": 1,
    "areaInfo": [
        {
            "title": "主+陽",
            "area": 28.06
        },
        {
            "title": "公共設施",
            "area": 12.36
        },
        {
            "title": "主建物",
            "area": 26.2
        },
        {
            "title": "陽台",
            "area": 1.86
        }
    ],
    "sfside": True,
    "sfdarkroom": False,
    "hasmanager": "日間",
    "monthlyFee": "1425",
    "roomplus": 0,
    "hallplus": 0,
    "bathroomplus": 0,
    "openroomplus": 0,
    "houseFront": None,
    "buildingFront": "北",
    "windowFront": None,
    "parking": None,
    "latitude": 25.051072449272,
    "longitude": 121.56892219082,
    "isSameTrade": False,
    "vrImgUrl": "https://res.sinyi.com.tw/buy/04255Y/3dvr/04255Y.jpg",
    "directionland": None,
    "firstDisplay": "2021-06-01 18:57:14",
    "detail": {  # 物件详情
        "buildingStructure": "鋼筋混凝土",
        "wallStructure": "二丁掛",
        "family": "3",
        "purpose": "商業用",
        "other": None,
        "partition": "第三種商業區;",
        "notice": None
    },
    "description": [  # 物件特色
        "屋況維持佳，採光明亮",
        "機能好，樓下有７１１",
        "近南京三民捷運站便捷",
        "一層３戶單純雙部電梯",
        "房間都有窗邊間好利用",
        "首購自用皆適合",
        "朝北棟距遠景觀好",
        "屋主希望民俗月前出售"
    ],
    "tags": [
        "7",  # 有裝潢
        "3",  # 前後陽台
        "4",  # 有陽台
        "2",  # 房間皆有窗
        "12",  # 警衛管理
        "10",  # 具垃圾處理
        "16",  # 近公園
        "18",  # 近市場
        "19"  # 近學校
    ],
    "lifeInfo": [  # 交通环境
        {
            "type": "traffic",
            "image": "https://res.sinyi.com.tw/buy/04255Y/lifeimg/L01.JPG",
            "info": [
                {
                    "title": "G 捷運南京三民站 - 出口3",
                    "distance": 441,
                    "time": "339",
                    "lifeLatitude": 25.051328,
                    "lifeLongitude": 121.564595
                },
                {
                    "title": "F 捷運南京三民站 - 出口4",
                    "distance": 445,
                    "time": "355",
                    "lifeLatitude": 25.051588,
                    "lifeLongitude": 121.56471
                }
            ]
        },
        {
            "type": "school",
            "image": "https://res.sinyi.com.tw/buy/04255Y/lifeimg/L02.JPG",
            "info": [
                {
                    "title": "0 臺北市私立松迪幼兒園",
                    "distance": 407,
                    "time": "",
                    "lifeLatitude": 25.050808,
                    "lifeLongitude": 121.564884
                },
                {
                    "title": "1 市立興雅國小",
                    "distance": 420,
                    "time": "",
                    "lifeLatitude": 25.047347,
                    "lifeLongitude": 121.569654
                }
            ]
        },
        {
            "type": "market",
            "image": "https://res.sinyi.com.tw/buy/04255Y/lifeimg/L03.JPG",
            "info": [
                {
                    "title": "0 臺北市公有南松市場",
                    "distance": 201,
                    "time": "",
                    "lifeLatitude": 25.050728,
                    "lifeLongitude": 121.570885
                },
                {
                    "title": "1 美廉社",
                    "distance": 208,
                    "time": "",
                    "lifeLatitude": 25.049787,
                    "lifeLongitude": 121.567414
                }
            ]
        },
        {
            "type": "hospital",
            "image": "https://res.sinyi.com.tw/buy/04255Y/lifeimg/L04.JPG",
            "info": [
                {
                    "title": "0 雙悅診所",
                    "distance": 63,
                    "time": "",
                    "lifeLatitude": 25.051098,
                    "lifeLongitude": 121.568294
                },
                {
                    "title": "1 親親家庭診所",
                    "distance": 129,
                    "time": "",
                    "lifeLatitude": 25.051528,
                    "lifeLongitude": 121.567744
                }
            ]
        },
        {
            "type": "other",
            "image": "https://res.sinyi.com.tw/buy/04255Y/lifeimg/L05.JPG",
            "info": [
                {
                    "title": "0 城隍廟",
                    "distance": 182,
                    "time": "",
                    "lifeLatitude": 25.049867,
                    "lifeLongitude": 121.570155
                },
                {
                    "title": "1 紫福宮",
                    "distance": 206,
                    "time": "",
                    "lifeLatitude": 25.049557,
                    "lifeLongitude": 121.570105
                }
            ]
        }
    ]
}

all_house_land_type = {'A': "公寓", 'B': "電梯大樓", 'C': "套房", 'D': "別墅/透天", 'F': "辦公", 'H': "倉庫", 'E': "店面", 'G': "廠房",
                       'I': "土地", 'J': "單售車位", 'K': "其他", 'L': "大樓", 'M': "華廈"}

all_city = {1: "台北市", 2: "新北市", 3: "基隆市", 4: "宜蘭縣", 5: "新竹市", 6: "新竹縣", 7: "桃園市", 8: "苗栗縣", 9: "台中市", 10: "彰化縣",
            11: "南投縣", 12: "雲林縣", 13: "嘉義市", 14: "嘉義縣", 15: "台南市", 16: "高雄市", 17: "屏東縣", 18: "台東縣", 19: "花蓮縣",
            20: "澎湖縣", 21: "金門縣", 22: "連江縣"}

all_city_area = {100: "中正區", 103: "大同區", 104: "中山區", 105: "松山區", 106: "大安區", 108: "萬華區", 110: "信義區", 111: "士林區",
                 112: "北投區", 114: "內湖區", 115: "南港區", 116: "文山區", 200: "仁愛區", 201: "信義區", 202: "中正區", 203: "中山區",
                 204: "安樂區", 205: "暖暖區", 206: "七堵區", 207: "萬里區", 208: "金山區", 209: "南竿鄉", 210: "北竿鄉", 211: "莒光鄉",
                 212: "東引鄉", 220: "板橋區", 221: "汐止區", 222: "深坑區", 223: "石碇區", 224: "瑞芳區", 226: "平溪區", 227: "雙溪區",
                 228: "貢寮區", 231: "新店區", 232: "坪林區", 233: "烏來區", 234: "永和區", 235: "中和區", 236: "土城區", 237: "三峽區",
                 238: "樹林區", 239: "鶯歌區", 241: "三重區", 242: "新莊區", 243: "泰山區", 244: "林口區", 247: "蘆洲區", 248: "五股區",
                 249: "八里區", 251: "淡水區", 252: "三芝區", 253: "石門區", 260: "宜蘭市", 261: "頭城鎮", 262: "礁溪鄉", 263: "壯圍鄉",
                 264: "員山鄉", 265: "羅東鎮", 266: "三星鄉", 267: "大同鄉", 268: "五結鄉", 269: "冬山鄉", 270: "蘇澳鎮", 272: "南澳鄉",
                 290: "釣魚台列嶼", 300: "新竹市", 302: "竹北市", 303: "湖口鄉", 304: "新豐鄉", 305: "新埔鎮", 306: "關西鎮", 307: "芎林鄉",
                 308: "寶山鄉", 310: "竹東鎮", 311: "五峰鄉", 312: "橫山鄉", 313: "尖石鄉", 314: "北埔鄉", 315: "峨眉鄉", 320: "中壢區",
                 324: "平鎮區", 325: "龍潭區", 326: "楊梅區", 327: "新屋區", 328: "觀音區", 330: "桃園區", 333: "龜山區", 334: "八德區",
                 335: "大溪區", 336: "復興區", 337: "大園區", 338: "蘆竹區", 350: "竹南鎮", 351: "頭份市", 352: "三灣鄉", 353: "南庄鄉",
                 354: "獅潭鄉", 356: "後龍鎮", 357: "通霄鎮", 358: "苑裡鎮", 360: "苗栗市", 361: "造橋鄉", 362: "頭屋鄉", 363: "公館鄉",
                 364: "大湖鄉", 365: "泰安鄉", 366: "銅鑼鄉", 367: "三義鄉", 368: "西湖鄉", 369: "卓蘭鎮", 400: "中區", 401: "東區",
                 402: "南區", 403: "西區", 404: "北區", 406: "北屯區", 407: "西屯區", 408: "南屯區", 411: "太平區", 412: "大里區",
                 413: "霧峰區", 414: "烏日區", 420: "豐原區", 421: "后里區", 422: "石岡區", 423: "東勢區", 424: "和平區", 426: "新社區",
                 427: "潭子區", 428: "大雅區", 429: "神岡區", 432: "大肚區", 433: "沙鹿區", 434: "龍井區", 435: "梧棲區", 436: "清水區",
                 437: "大甲區", 438: "外埔區", 439: "大安區", 500: "彰化市", 502: "芬園鄉", 503: "花壇鄉", 504: "秀水鄉", 505: "鹿港鎮",
                 506: "福興鄉", 507: "線西鄉", 508: "和美鎮", 509: "伸港鄉", 510: "員林市", 511: "社頭鄉", 512: "永靖鄉", 513: "埔心鄉",
                 514: "溪湖鎮", 515: "大村鄉", 516: "埔鹽鄉", 520: "田中鎮", 521: "北斗鎮", 522: "田尾鄉", 523: "埤頭鄉", 524: "溪州鄉",
                 525: "竹塘鄉", 526: "二林鎮", 527: "大城鄉", 528: "芳苑鄉", 530: "二水鄉", 540: "南投市", 541: "中寮鄉", 542: "草屯鎮",
                 544: "國姓鄉", 545: "埔里鎮", 546: "仁愛鄉", 551: "名間鄉", 552: "集集鎮", 553: "水里鄉", 555: "魚池鄉", 556: "信義鄉",
                 557: "竹山鎮", 558: "鹿谷鄉", 600: "嘉義市", 602: "番路鄉", 603: "梅山鄉", 604: "竹崎鄉", 605: "阿里山鄉", 606: "中埔鄉",
                 607: "大埔鄉", 608: "水上鄉", 611: "鹿草鄉", 612: "太保市", 613: "朴子市", 614: "東石鄉", 615: "六腳鄉", 616: "新港鄉",
                 621: "民雄鄉", 622: "大林鎮", 623: "溪口鄉", 624: "義竹鄉", 625: "布袋鎮", 630: "斗南鎮", 631: "大埤鄉", 632: "虎尾鎮",
                 633: "土庫鎮", 634: "褒忠鄉", 635: "東勢鄉", 636: "臺西鄉", 637: "崙背鄉", 638: "麥寮鄉", 640: "斗六市", 643: "林內鄉",
                 646: "古坑鄉", 647: "莿桐鄉", 648: "西螺鎮", 649: "二崙鄉", 651: "北港鎮", 652: "水林鄉", 653: "口湖鄉", 654: "四湖鄉",
                 655: "元長鄉", 700: "中西區", 701: "東區", 702: "南區", 704: "北區", 708: "安平區", 709: "安南區", 710: "永康區",
                 711: "歸仁區", 712: "新化區", 713: "左鎮區", 714: "玉井區", 715: "楠西區", 716: "南化區", 717: "仁德區", 718: "關廟區",
                 719: "龍崎區", 720: "官田區", 721: "麻豆區", 722: "佳里區", 723: "西港區", 724: "七股區", 725: "將軍區", 726: "學甲區",
                 727: "北門區", 730: "新營區", 731: "後壁區", 732: "白河區", 733: "東山區", 734: "六甲區", 735: "下營區", 736: "柳營區",
                 737: "鹽水區", 741: "善化區", 742: "大內區", 743: "山上區", 744: "新市區", 745: "安定區", 800: "新興區", 801: "前金區",
                 802: "苓雅區", 803: "鹽埕區", 804: "鼓山區", 805: "旗津區", 806: "前鎮區", 807: "三民區", 811: "楠梓區", 812: "小港區",
                 813: "左營區", 814: "仁武區", 815: "大社區", 817: "東沙群島", 819: "南沙群島", 820: "岡山區", 821: "路竹區", 822: "阿蓮區",
                 823: "田寮區", 824: "燕巢區", 825: "橋頭區", 826: "梓官區", 827: "彌陀區", 828: "永安區", 829: "湖內區", 830: "鳳山區",
                 831: "大寮區", 832: "林園區", 833: "鳥松區", 840: "大樹區", 842: "旗山區", 843: "美濃區", 844: "六龜區", 845: "內門區",
                 846: "杉林區", 847: "甲仙區", 848: "桃源區", 849: "那瑪夏區", 851: "茂林區", 852: "茄萣區", 880: "馬公市", 881: "西嶼鄉",
                 882: "望安鄉", 883: "七美鄉", 884: "白沙鄉", 885: "湖西鄉", 890: "金沙鎮", 891: "金湖鎮", 892: "金寧鄉", 893: "金城鎮",
                 894: "烈嶼鄉", 896: "烏坵鄉", 900: "屏東市", 901: "三地門鄉", 902: "霧臺鄉", 903: "瑪家鄉", 904: "九如鄉", 905: "里港鄉",
                 906: "高樹鄉", 907: "鹽埔鄉", 908: "長治鄉", 909: "麟洛鄉", 911: "竹田鄉", 912: "內埔鄉", 913: "萬丹鄉", 920: "潮州鎮",
                 921: "泰武鄉", 922: "來義鄉", 923: "萬巒鄉", 924: "崁頂鄉", 925: "新埤鄉", 926: "南州鄉", 927: "林邊鄉", 928: "東港鎮",
                 929: "琉球鄉", 931: "佳冬鄉", 932: "新園鄉", 940: "枋寮鄉", 941: "枋山鄉", 942: "春日鄉", 943: "獅子鄉", 944: "車城鄉",
                 945: "牡丹鄉", 946: "恆春鎮", 947: "滿州鄉", 950: "臺東市", 951: "綠島鄉", 952: "蘭嶼鄉", 953: "延平鄉", 954: "卑南鄉",
                 955: "鹿野鄉", 956: "關山鎮", 957: "海端鄉", 958: "池上鄉", 959: "東河鄉", 961: "成功鎮", 962: "長濱鄉", 963: "太麻里鄉",
                 964: "金峰鄉", 965: "大武鄉", 966: "達仁鄉", 970: "花蓮市", 971: "新城鄉", 972: "秀林鄉", 973: "吉安鄉", 974: "壽豐鄉",
                 975: "鳳林鎮", 976: "光復鄉", 977: "豐濱鄉", 978: "瑞穗鄉", 979: "萬榮鄉", 981: "玉里鎮", 982: "卓溪鄉", 983: "富里鄉"}

all_tags = {1: "毛胚屋", 2: "房間皆有窗", 3: "前後陽台", 4: "有陽台", 5: "廁所開窗", 6: "有景觀", 7: "有裝潢", 8: "健身房", 9: "游泳池", 10: "具垃圾處理",
            11: "花園", 12: "警衛管理", 13: "新上架", 14: "店長推薦", 15: "無障礙空間", 16: "近公園", 17: "近捷運", 18: "近市場", 19: "近學校",
            20: "低總價", 21: "租賃中", 22: "三角窗", 100: "有2D/3D看屋"}

if __name__ == '__main__':
    print(all_city[3])
